# Brewfile - Homebrew package dependencies

# CLI Tools
brew "starship"
brew "jq"
brew "eza"
brew "bat"
brew "rg"
brew "fd"
brew "delta"
brew "fzf"
brew "zoxide"
brew "zsh"
brew "tmux"

# Developer Tools
cask "docker"
cask "visual-studio-code"
cask "jetbrains-toolbox"


# Applications
cask "wezterm"
cask "google-chrome"
cask "discord"
cask "rectangle"
cask "vlc"
cask "maccy"
cask "jetbrains-toolbox"
cask "1password"
cask "flux"
cask "caffeine"
cask "sourcetree"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-monaspace"

# Mac App Store Apps
mas "Xcode", id: 497799835
